respostas_app/app/controllers/importantes_controller.rb

  def index
	@produtos = Produto.all.order("item")
---
SELECT "produtos".* FROM "produtos"   ORDER BY item