respostas_app/app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all.order("item")
---
SELECT "produtos".* FROM "produtos"   ORDER BY item

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("created_at", "importante", "item", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-27 06:21:01.802678"], ["importante", "true"], ["item", "teste1"], ["updated_at", "2014-11-27 06:21:01.802678"]]

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT  "produtos".* FROM "produtos"  WHERE "produtos"."id" = ? LIMIT 1  [["id", 1]]